[
    {
    "business_id":"WnmU4a6rpfQ3npNhR4N1JA",
    "cool":113,
    "date":"2013-10-10 05:18:43",
    "funny":112,
    "review_id":"SYgav7RZB8iGr1ziaUK1uA",
    "stars":1.0,
    "text":"Before anyone can ask why I was here, I was here with my college classmates on our bi annual college pub crawl after finals. \n\nBasically, a bunch of college students looking to have a good time and we decided to start at Dancing Bare.\n\nBad choice, this place is so unsanitary, I didn't even have a drink. One of my friends was terrified of catching some weird disease as we're pretty sure our waitress pulled money out of her chest. \n\nThe show of the night was just one star. And nicely put, she didn't seem like she was built to make dancing on a pole her career. It looked really sloppy - I could have done a better job. \n\nIt was swarming with college students when  we went, but also filled with creepy older men who really shouldn't be looking anyway. I wouldn't feel safe being here alone. Poor workers, hope they find a better employment opportunity.",
    "useful":116,
    "user_id":"mtGw8bQTQToVR_1KWD7F7A"
    },
    {
    "business_id":"5-nUL-_CTYIzya5WG7bf5A",
    "cool":168,
    "date":"2017-09-14 19:16:56",
    "funny":149,
    "review_id":"ZAmHKW7WaK9XQqMonhEyKw",
    "stars":2.0,
    "text":"I may be the biggest fan of Holeman & Finch's Double Stack burger in the city, but I'm unbelievably disappointed by the burger I had at this location! Holeman and Finch has long ranked as my number one favorite place for a burger in Atlanta. Their original location used to only serve 24 burgers a night after 9pm and all day on the Sunday brunch menu. I truly miss those days because it made the burger a big deal and great care was made to prepare it! Since opening burger only restaurants, the quality has deteriorated to that of your typical fast food chains.\n\nI am utterly shocked that anyone familiar with the original would give this burger more than 3 stars, because AT BEST it's average. I was so shocked that I went back a week later to try it again, and still I left disappointed. This burger, in my opinion, tastes nothing like its predecessor. They are so different in fact that I'm still having a hard time believing they are of the same origins and honestly feel kind of offended they are trying to pass off this imposter for more money!!! Even my teenage boys said: \"This is the burger you've been bragging about dad? It's not that good!\"\n\nNO BUENO H&F Burger! No Bueno! I'm embarrassed that I've been singing your praises. I suddenly find myself needing to go over to the original location to do a taste test so I can be assured I'm not crazy and have not been living a lie! Three stars for the burger, minus a star for making me love you then destroying my joy of eating what once was my favorite burger!\n\n\n2017/133",
    "useful":198,
    "user_id":"JjXuiru1_ONzDkYVrHN0aw"
    },
    {
    "business_id":"6p38z1td1y7iWRN_UJHl9A",
    "cool":348,
    "date":"2020-01-23 17:35:16",
    "funny":264,
    "review_id":"rkDD-c2kFGfA22nPbrN_mw",
    "stars":3.0,
    "text":"[ DISCLAIMER ] \nI'm not a complainer. Never have been nor do I care to write or read negative reviews, but I feel I've been provoked.\n\n***\n\nI've loved the BEEF RIBS at Community Q since I first tasted them, which is saying a lot considering I prefer pork ribs and generally dislike beef ribs. I came here more often when the beef ribs were available daily. Then they switched to Wednesday's only and would often sell out early, which made it difficult for me considering I'm 38 miles away in the suburbs. \n\n\nFAST FORWARD TO TODAY [ January 22nd, 2020 ] \n\nHave you ever craved a certain food so much that you almost couldn't wait to get to the restaurant? \n\nThat was me as I drove nearly 50 minutes one-way to Community Q. Mom is in town visiting and I've been bragging about the beef ribs here for weeks prior to her visit. \"You know I don't like beef ribs\" she protested. \"It's okay mom\" I said. \"I don't really like beef ribs either, but I promise you're going to LOVE these!\"\n\nMom was feeling under the weather and didn't want to battle Atlanta traffic. Since she'll be returning to her city before the beef ribs would typically be available again, I set out to get them alone. \n\n***\n\nTHE EXPERIENCE \n\nI arrived hungry and with great anticipation when I noticed a sign posted on the door saying the beef ribs are now ONLY available as a 4 day advanced pre-order @ MORE THAN DOUBLE their usual price of $16 per bone!!! To add insult to injury, they require pre-orders to be a minimum of 3 bones totaling $114 ($38 each). \n\nFUN FACT: Cows have 26 ribs\n\nShocked and in total disbelief to see this news, I came inside to verify the sign was correct with the cashier. Her answer, while not rude, was very matter-of-fact as she explained beef prices have gone way up. 'Really? Beef has doubled in cost?' I thought to myself. She further said they'd just started this new pre-order malarkey a week earlier.\n\nBUT HERE IS WHAT REALLY ANNOYED ME - All the while the store manager stood nearby and didn't say a word, despite how obviously taken back I was with the entire situation. It truly bothered me that he kept his back to me and let the cashier do the explaining with no follow-up.\n\nSo I gathered myself together, ordered the pork ribs instead, 2 other meats and a bunch of sides (I overcompensated for my disappointment). I sat near the counter waiting for about 5 minutes. Typically this place is crazy busy, but there were barely 5 customers in the whole place. I would have been less annoyed had my shock been greeted with understanding instead of 'oh well, this is how it is, can't control it.' \n\nSomehow I thought they would take a moment (since it was not busy) to smooth over my obvious disappointment, but no further discourse transpired until I picked up the order when my name was called. That's when the manage said \"I put a little dessert in there.\"\n\nI replied \"Thank you\" and felt somewhat good that at least they acknowledged my pain with some sort of friendly gesture. That is, until I tasted the muffin dessert at home, which was not very good. In general I've enjoyed the food here, but today the muffin, smoked sausage and BBQ chicken were all my first time trying AND the first things I've ever disliked. Everything else was great.\n\n***\n\nFINAL THOUGHTS \n\nIn my humble opinion it seems they just don't want to cook beef ribs anymore and this 'so called' beef cost increase is an over exaggerated excuse. I checked with other places that sell beef ribs and no one else seems to be drastically increasing their pricing. Seems like the sign SHOULD say: \"We'll go through the trouble if you pay us double.\"\n\nBOTTOM LINE, if this outrageous price is what they will be charging for beef ribs, then it was my last visit. Plenty of places sell good pork ribs closer to home. Disappointed that a place I've loved and bragged about for nearly a decade has come to this, but I suppose nothing good last forever. Still, hard to swallow someone in management thought this was acceptable to present to its customers.\n\n\n2020 / 3",
    "useful":446,
    "user_id":"JjXuiru1_ONzDkYVrHN0aw"
    },
    {
    "business_id":"dhygmTsXnLdpPdHcGEcmpw",
    "cool":721,
    "date":"2007-08-17 15:50:39",
    "funny":0,
    "review_id":"6tBVsiyr1dm1UZs92rYojw",
    "stars":4.0,
    "text":"This is a TINY diner - it has zero indoor tables, 4 outdoor tables, and only 11 barstools that are bolted to the perimeter of the interior. the menu is limited. only two people work here. the only beverages you'll find besides fresh coffee are in the coca cola refridgerator near the door. \n\nit's FANTASTIC! I'm so pleased to be the first review, my amigo and i came by here for brunch one sunday, quickly got a seat and ordered their scrambled egg sandwich and a side of cinnamon french toast. the sandwich is called The Sammy S___, i don't remember the surname but it's easy to identify. this is 3 scrambled eggs (at least) stuffed with american cheese and homefries. yes, the homefries are IN the egg sandwich. this whole concoction is set inside an 8 inch sesame braided roll...the kind you get meatball subs in. \n\nwhen our server brought 1 sandwich and the french toast we thought we were sharing the sammy, which would have been enough really. then she brought the second one and we looked at each other wide-eyed. both the french toast and the egg sandwich were really tasty. if you're in malden get yourself over to this place!",
    "useful":90,
    "user_id":"rzq5nqG2NG13o3ISxJSrsQ"
    },
    {
    "business_id":"dhygmTsXnLdpPdHcGEcmpw",
    "cool":732,
    "date":"2009-06-29 18:07:38",
    "funny":0,
    "review_id":"M6_zWod3fiUQJmgYFbiUfg",
    "stars":5.0,
    "text":"My wife and I went to the Lunch Box for brunch on a Monday and were given first class service by both Nick, the owner, and his wife, Laura.  The food was great and the portions are HUGE.  My wife and I shared the Lunch Box Special (3 eggs, toast, Italian sausage, home fries, and 2 pancakes) and it was more than enough food for the 2 of us.  Nick's fresh blueberry pancakes were the biggest fluffiest pancakes I have ever had in my life!  We couldn't even finish them they were so big.  Sure the place is tiny and everyone hears everyone else's conversations but I feel like that's half the fun of coming to the Lunch Box Diner.  You feel like you're sitting in Nick's kitchen while he cooks you breakfast.  I loved it!  I will most definitely go back again and again.",
    "useful":107,
    "user_id":"t6GcTUvCyfdYegVV9yU5Qw"
    }
]