[
    {
    "business_id":"dhygmTsXnLdpPdHcGEcmpw",
    "cool":0,
    "date":"2011-05-14 17:35:55",
    "funny":392,
    "review_id":"qJLE1AomI4Pv71Dv2gubbw",
    "stars":1.0,
    "text":"We didn't even get to eat there.\n\nWe walked in and took two counter seats in the corner as there were bags and clothes spread out on the table seats which made it look like there were customers using the restroom.  The bags and jackets turned out to be owned by all of the people working there.  It appears to be a family affair as most of the staff were under the age of ten.  It might just be me, but I don't really like my waitress to be eight years old.  The older gentleman sitting at a table in the center of the establishment at first appeared to be a customer, but when the fire alarm went off and no one moved or said anything about it, he was the one who started telling the one of the children how to turn it off.  At that point, the noise had become so loud and prolonged that the children started running outside to hide from it.  We left without ordering.  The food may be fabulous (who knows?), but the service and atmosphere made eating there impossible.",
    "useful":1,
    "user_id":"-rOZpe--GkTIHzlRPCrabg"
    },
    {
    "business_id":"dhygmTsXnLdpPdHcGEcmpw",
    "cool":0,
    "date":"2009-03-22 16:46:48",
    "funny":610,
    "review_id":"mdbkcfoQWrFD3xAYCEEfZw",
    "stars":2.0,
    "text":"this place has changed ownership..went there and got a breakfast sandwich..not the same at all,,very average.",
    "useful":0,
    "user_id":"M2t8q2FmhN_47PZJj-4ejA"
    },
    {
    "business_id":"6p38z1td1y7iWRN_UJHl9A",
    "cool":348,
    "date":"2020-01-23 17:35:16",
    "funny":264,
    "review_id":"rkDD-c2kFGfA22nPbrN_mw",
    "stars":3.0,
    "text":"[ DISCLAIMER ] \nI'm not a complainer. Never have been nor do I care to write or read negative reviews, but I feel I've been provoked.\n\n***\n\nI've loved the BEEF RIBS at Community Q since I first tasted them, which is saying a lot considering I prefer pork ribs and generally dislike beef ribs. I came here more often when the beef ribs were available daily. Then they switched to Wednesday's only and would often sell out early, which made it difficult for me considering I'm 38 miles away in the suburbs. \n\n\nFAST FORWARD TO TODAY [ January 22nd, 2020 ] \n\nHave you ever craved a certain food so much that you almost couldn't wait to get to the restaurant? \n\nThat was me as I drove nearly 50 minutes one-way to Community Q. Mom is in town visiting and I've been bragging about the beef ribs here for weeks prior to her visit. \"You know I don't like beef ribs\" she protested. \"It's okay mom\" I said. \"I don't really like beef ribs either, but I promise you're going to LOVE these!\"\n\nMom was feeling under the weather and didn't want to battle Atlanta traffic. Since she'll be returning to her city before the beef ribs would typically be available again, I set out to get them alone. \n\n***\n\nTHE EXPERIENCE \n\nI arrived hungry and with great anticipation when I noticed a sign posted on the door saying the beef ribs are now ONLY available as a 4 day advanced pre-order @ MORE THAN DOUBLE their usual price of $16 per bone!!! To add insult to injury, they require pre-orders to be a minimum of 3 bones totaling $114 ($38 each). \n\nFUN FACT: Cows have 26 ribs\n\nShocked and in total disbelief to see this news, I came inside to verify the sign was correct with the cashier. Her answer, while not rude, was very matter-of-fact as she explained beef prices have gone way up. 'Really? Beef has doubled in cost?' I thought to myself. She further said they'd just started this new pre-order malarkey a week earlier.\n\nBUT HERE IS WHAT REALLY ANNOYED ME - All the while the store manager stood nearby and didn't say a word, despite how obviously taken back I was with the entire situation. It truly bothered me that he kept his back to me and let the cashier do the explaining with no follow-up.\n\nSo I gathered myself together, ordered the pork ribs instead, 2 other meats and a bunch of sides (I overcompensated for my disappointment). I sat near the counter waiting for about 5 minutes. Typically this place is crazy busy, but there were barely 5 customers in the whole place. I would have been less annoyed had my shock been greeted with understanding instead of 'oh well, this is how it is, can't control it.' \n\nSomehow I thought they would take a moment (since it was not busy) to smooth over my obvious disappointment, but no further discourse transpired until I picked up the order when my name was called. That's when the manage said \"I put a little dessert in there.\"\n\nI replied \"Thank you\" and felt somewhat good that at least they acknowledged my pain with some sort of friendly gesture. That is, until I tasted the muffin dessert at home, which was not very good. In general I've enjoyed the food here, but today the muffin, smoked sausage and BBQ chicken were all my first time trying AND the first things I've ever disliked. Everything else was great.\n\n***\n\nFINAL THOUGHTS \n\nIn my humble opinion it seems they just don't want to cook beef ribs anymore and this 'so called' beef cost increase is an over exaggerated excuse. I checked with other places that sell beef ribs and no one else seems to be drastically increasing their pricing. Seems like the sign SHOULD say: \"We'll go through the trouble if you pay us double.\"\n\nBOTTOM LINE, if this outrageous price is what they will be charging for beef ribs, then it was my last visit. Plenty of places sell good pork ribs closer to home. Disappointed that a place I've loved and bragged about for nearly a decade has come to this, but I suppose nothing good last forever. Still, hard to swallow someone in management thought this was acceptable to present to its customers.\n\n\n2020 / 3",
    "useful":446,
    "user_id":"JjXuiru1_ONzDkYVrHN0aw"
    },
    {
    "business_id":"NCdyIQbvr4zwqbR3MlEjJQ",
    "cool":371,
    "date":"2019-12-31 21:33:52",
    "funny":259,
    "review_id":"S2ryW1LQ6Ud_JHykOEjPkg",
    "stars":4.0,
    "text":"It's been a while , but contrary to my previous Fred's review, I actually have been back several times (even though I swore I would never return). How could I not? Krog Street Market and its proximity to the Atlanta Beltline makes it an ideal place to hang out in the city for food, fun and outdoor activities.\n\nIf you are anywhere in this area and crave a double-cheeseburger, Fred's is easily one of the city's top destinations. However, this visit was not about the burgers, but solely centered around the cheesesteaks.\n\n\n| THE SCENE |\n\nI have four daughters you see, but only one shares my DNA. Two are by marriage to my sons and one from acting as her father in her natural fathers stead. This Christmas I was blessed to have all my children (and grandchildren) home at the same time. So, as a special treat, I took the girls out for cheesesteaks. Our first choice was Big Dave's, but upon arriving at their new downtown location we were told the wait would be one hour and 15 minutes.\n\nNeedless to say we were not interested in such a long wait and after careful consideration, I decided to give Fred's another go! So glad we did! Our cheesesteaks were phenomenal! So much so in fact that I was left questioning how in the world did I not enjoy it the first time?\n\n\n| THE CHEESESTEAKS |\n\nHonestly, this is one of the best cheesesteaks I've had in a long time... maybe ever!!! Either my experience here a few years ago was a \"bad day\" situation or they have improved tremendously. The beef was tender and beefy, and the cheese, onions and bread were perfectly proportionate. Each bite left me wanting for nothing but another bite and OMG, the bread was perfect in both its softness and chewiness.\n\nMy daughters like it a little spicier and they chose the Korean Cheesesteak which comes with gochujang sauce, american cheese, candied jalapeño, green onion & garlic aioli. Too spicy for me, but they all loved it... except for the candied jalapeños (which they got on the side). These girls are EXTREMELY picky and between the three gave it an average score of 4.5.\n\n\n| THE FRIES |\n\nI was born eating french fries. It has been my favorite food since I was old enough to remember eating. Fred's regular fries rank as some of my favorites fries anywhere, but dip them in the aioli and you truly have something special.\n\nMy daughters all wanted the garlic fries, which they LOVED. But even though I adore garlic on everything, it was a bit too much for me. I am totally satisfied staying in my regular fry lane!\n\n\n| FINAL THOUGHTS |\n\nWhile I truly enjoyed this experience, I'm going to remain moderate in my star upgrade from my previous review. However, if they pull of a cheesesteak masterpiece like this again in a future visit, I will upgrade them to a 5 for sure!\n\n\n\n2019 / 136th review [138th update]",
    "useful":411,
    "user_id":"JjXuiru1_ONzDkYVrHN0aw"
    },
    {
    "business_id":"vgn1LR6IaHW_v24x64vp3Q",
    "cool":530,
    "date":"2015-08-07 22:50:47",
    "funny":529,
    "review_id":"E7vQdecsvCYLaXsA76VVqA",
    "stars":5.0,
    "text":"This is my first yelp review. I love this place for so many reasons. THE VIBE IS SO GOOD AND COZY. The employees are very nice too. My iced coffee was great also. Overall very happy. thanks for being so good vibe. Haha",
    "useful":398,
    "user_id":"5-WdUN5ECABrjXtPPYiLmA"
    }
]
