[
    {
    "business_id":"n3Rdrp11wEvYhcFPFY-BYQ",
    "cool":5,"date":"2011-07-10 00:22:23",
    "funny":11,
    "review_id":"r3WfwSBRN21hneQtnou4cQ",
    "stars":1.0,
    "text":"If you need to lose less than twenty pounds, don't try this.  There is no guaranty to the program and it will cost you $1300 for four months.  We wasted our money and I only lost six pounds! I could have done that on my own and saved a lot of money... When you go for your free consult, they hard sell you on weight loss and gaining good health... so you sign... You get four months of \"classes\" and pre-recorded taped hynosis sessions - very generic... and you get three personalized hypnosis sessions... that's it!  We were led to believe this program would be completely personalized and that they would do anything they could to help us meet our goal.. my goal was to lose 16 pounds... \"no problem\", even encouraged me to change that to more... so I did, \"let's try for twenty\".  After four months, I lost six pounds - the same amount I lost the first month in the program.  Then when I told them I didn't meet my goal at the end of the program, they told me weight loss of any specific amount was not guaranteed!  But hey, \"don't you feel healthier now?\" - LOL!  Yes, I do feel healthier but I am also out of the $2600 my husband and I paid for this \"program\"... oh yah, he almost met his goal, he lost about 17 pounds of his 20 pound goal... but then again, most men can lose weight by just changing their intake!  I do not recommend this program, you can get a better value by spending it on a personal trainer at the gym and probably pay less.  \n\nIf you really want to be hypnotized, try a medical hypnotist or someone who specializes in one on one hypnosis.  My sister went to a medical hypnotist and paid $150, and she did see a huge difference.  Plus she quit smoking at the same time.  She got a much better deal, lost twenty pounds, and had her doctor's support. BTW - this program not only does NOT have any sort of guaranty, but it also is not medically backed in any way...",
    "useful":316,
    "user_id":"P3z03JOg0yk_MbX3hmLw2Q"
    },
    {
    "business_id":"nupzeBkyCL7u9JfTUqkAIw",
    "cool":108,
    "date":"2011-02-09 04:24:32",
    "funny":210,
    "review_id":"9cxBCMg23SQeb6BdgjKkqA",
    "stars":2.0,
    "text":"Let me get this out of the way: I never participated in Quick Weight Loss Center's diet. My wife did. I am only a third party observer. Since I have an interest in diet and fitness, their methods intrigued me. \n\nMy wife stayed on this diet consistently for a little over a month. I feel I have a good idea on the initial phase of the diet. So I want to write about their diet and what I thought of it. \n\nTHE GOOD PARTS\n\nThis diet works. Then again, all diets that decrease your calorie consumption works. If you follow their directions carefully, you are guaranteed to lose weight fast. \n\nThey also require you to come into the center at least three times a week. I find that great because they give you accountability. They track your progress frequently and will give you necessary encouragement when you need it. My wife found this helpful because she won't listen to me, but she will listen to strangers. \n\nTheir diet is very healthy. When my wife was on this diet, I was pretty much on this diet as well. Even though I didn't follow it as closely as she did, I still lost weight. Of course, I didn't lose it as fast as she did, but I still did lose weight. I'm pretty sure my blood pressure, cholesterol, etc. went down as well. \n\nYou don't need exercise to lose weight with this diet. That's right, you can sit on your flabby butt and still lose weight. This program is great if you don't like to exercise much. Of course, it can be better with exercise, but they don't require it.\n\nTHE BAD PARTS\n\nI have a lot of gripes about them though. First is that they are a business and need to make money. The people who work at Quick Weight Loss Centers are not doctors, nurses, dietitians, personal trainers, or whatever. They are salespeople. Their job is to sell the product. And their program is on the expensive side. \n\nThe diet is super boring. One of their sales pitch is you still enjoy your favorite restaurants. That is total BS. They don't technically lie about it. You can go to your favorite restaurants, but the only thing you'll be eating there are salads with no dressing, carrots, onions, etc. You need to order the most boring food possible, and you have to be the annoying guy who needs 1000 changes to a dish. \n\nIf you cook at home, it's not bad. But you have to follow their ridiculous rules in what food you can eat. I'm skeptical of them. Why would you only eat 1 type of meat with a certain type of vegetable? These \"optimal\" combinations seem arbitrary to me. \n\nThey have expensive supplements they push on you. Since all you do is eat boring, bland foods, they \"reward\" you with their supplements. Their supplements taste great actually. That's probably the only time in the day where you can eat yummy foods. They are expensive. They take advantage of the dieters who are craving something non-bland. I saw one woman buying almost $100 worth of their supplements in 1 day. I don't know how long that will last her. Maybe 2-3 weeks?\n\nThey have no \"cheat\" or \"reward\" days. You have to stick to the diet 24/7. This requires quite a bit of discipline. But hey, they're called QUICK Weight Loss Center, not Slow Weight Loss Center. I know from experience, if you deviate from the diet, you will stagnate or even gain weight. \n\nOnce you reach your goal weight, they ease you back into the normal foods. My wife never reached her stabilization phase. But from what I looked at it, it looked like the same old boring foods to me. \n\nIf you cheat you gain weight back. Yes, if you lose weight this fast, the second you diverge from this diet, your weight goes up as fast. My wife cheated slightly and her weight went up the next day. That is pretty depressing. Luckily they do have the stabilization phase to slowly ease you into it. \n\nSO SHOULD YOU DO IT?\n\nThat's up to you of course. I think this is a perfect diet for the Bride who need to lose 20 lbs fast for her wedding (give yourself about 2 months). I have to tell you that this diet is a huge lifestyle change. You will not be able to enjoy any of your  favorite foods such as ice cream, sodas, pork, onions, etc.\n\nThis is an expensive product. So make sure you have some disposable cash around if you want to start on this diet.\n\nLike I said, this diet works very well. You just have to have Bruce Lee type discipline and determination to not cheat the whole time you're on this diet. But my wife was able to stay on 95% of the time. The sales people who keep you accountable help a lot too. \n\nHonestly, if you're one of those people that can stick to a process and are disciplined, you can pick any other diet like Atkins, Slow Carb, Dukan, etc. They give you the same results, and it's a lot cheaper. \n\nBTW, the minute my wife stopped this diet, she gained all her weight back in a short amount of time. It's Quick Weight Loss, but if you stop it, it'll become Quick Weight Gain.",
    "useful":758,
    "user_id":"ChrkZVO5M-J6T_9FnsbUzw"
    },
    {
    "business_id":"6p38z1td1y7iWRN_UJHl9A",
    "cool":348,"date":"2020-01-23 17:35:16",
    "funny":264,"review_id":"rkDD-c2kFGfA22nPbrN_mw",
    "stars":3.0,
    "text":"[ DISCLAIMER ] \nI'm not a complainer. Never have been nor do I care to write or read negative reviews, but I feel I've been provoked.\n\n***\n\nI've loved the BEEF RIBS at Community Q since I first tasted them, which is saying a lot considering I prefer pork ribs and generally dislike beef ribs. I came here more often when the beef ribs were available daily. Then they switched to Wednesday's only and would often sell out early, which made it difficult for me considering I'm 38 miles away in the suburbs. \n\n\nFAST FORWARD TO TODAY [ January 22nd, 2020 ] \n\nHave you ever craved a certain food so much that you almost couldn't wait to get to the restaurant? \n\nThat was me as I drove nearly 50 minutes one-way to Community Q. Mom is in town visiting and I've been bragging about the beef ribs here for weeks prior to her visit. \"You know I don't like beef ribs\" she protested. \"It's okay mom\" I said. \"I don't really like beef ribs either, but I promise you're going to LOVE these!\"\n\nMom was feeling under the weather and didn't want to battle Atlanta traffic. Since she'll be returning to her city before the beef ribs would typically be available again, I set out to get them alone. \n\n***\n\nTHE EXPERIENCE \n\nI arrived hungry and with great anticipation when I noticed a sign posted on the door saying the beef ribs are now ONLY available as a 4 day advanced pre-order @ MORE THAN DOUBLE their usual price of $16 per bone!!! To add insult to injury, they require pre-orders to be a minimum of 3 bones totaling $114 ($38 each). \n\nFUN FACT: Cows have 26 ribs\n\nShocked and in total disbelief to see this news, I came inside to verify the sign was correct with the cashier. Her answer, while not rude, was very matter-of-fact as she explained beef prices have gone way up. 'Really? Beef has doubled in cost?' I thought to myself. She further said they'd just started this new pre-order malarkey a week earlier.\n\nBUT HERE IS WHAT REALLY ANNOYED ME - All the while the store manager stood nearby and didn't say a word, despite how obviously taken back I was with the entire situation. It truly bothered me that he kept his back to me and let the cashier do the explaining with no follow-up.\n\nSo I gathered myself together, ordered the pork ribs instead, 2 other meats and a bunch of sides (I overcompensated for my disappointment). I sat near the counter waiting for about 5 minutes. Typically this place is crazy busy, but there were barely 5 customers in the whole place. I would have been less annoyed had my shock been greeted with understanding instead of 'oh well, this is how it is, can't control it.' \n\nSomehow I thought they would take a moment (since it was not busy) to smooth over my obvious disappointment, but no further discourse transpired until I picked up the order when my name was called. That's when the manage said \"I put a little dessert in there.\"\n\nI replied \"Thank you\" and felt somewhat good that at least they acknowledged my pain with some sort of friendly gesture. That is, until I tasted the muffin dessert at home, which was not very good. In general I've enjoyed the food here, but today the muffin, smoked sausage and BBQ chicken were all my first time trying AND the first things I've ever disliked. Everything else was great.\n\n***\n\nFINAL THOUGHTS \n\nIn my humble opinion it seems they just don't want to cook beef ribs anymore and this 'so called' beef cost increase is an over exaggerated excuse. I checked with other places that sell beef ribs and no one else seems to be drastically increasing their pricing. Seems like the sign SHOULD say: \"We'll go through the trouble if you pay us double.\"\n\nBOTTOM LINE, if this outrageous price is what they will be charging for beef ribs, then it was my last visit. Plenty of places sell good pork ribs closer to home. Disappointed that a place I've loved and bragged about for nearly a decade has come to this, but I suppose nothing good last forever. Still, hard to swallow someone in management thought this was acceptable to present to its customers.\n\n\n2020 / 3",
    "useful":446,
    "user_id":"JjXuiru1_ONzDkYVrHN0aw"
    },
    {
    "business_id":"NCdyIQbvr4zwqbR3MlEjJQ",
    "cool":371,
    "date":"2019-12-31 21:33:52",
    "funny":259,
    "review_id":"S2ryW1LQ6Ud_JHykOEjPkg",
    "stars":4.0,
    "text":"It's been a while , but contrary to my previous Fred's review, I actually have been back several times (even though I swore I would never return). How could I not? Krog Street Market and its proximity to the Atlanta Beltline makes it an ideal place to hang out in the city for food, fun and outdoor activities.\n\nIf you are anywhere in this area and crave a double-cheeseburger, Fred's is easily one of the city's top destinations. However, this visit was not about the burgers, but solely centered around the cheesesteaks.\n\n\n| THE SCENE |\n\nI have four daughters you see, but only one shares my DNA. Two are by marriage to my sons and one from acting as her father in her natural fathers stead. This Christmas I was blessed to have all my children (and grandchildren) home at the same time. So, as a special treat, I took the girls out for cheesesteaks. Our first choice was Big Dave's, but upon arriving at their new downtown location we were told the wait would be one hour and 15 minutes.\n\nNeedless to say we were not interested in such a long wait and after careful consideration, I decided to give Fred's another go! So glad we did! Our cheesesteaks were phenomenal! So much so in fact that I was left questioning how in the world did I not enjoy it the first time?\n\n\n| THE CHEESESTEAKS |\n\nHonestly, this is one of the best cheesesteaks I've had in a long time... maybe ever!!! Either my experience here a few years ago was a \"bad day\" situation or they have improved tremendously. The beef was tender and beefy, and the cheese, onions and bread were perfectly proportionate. Each bite left me wanting for nothing but another bite and OMG, the bread was perfect in both its softness and chewiness.\n\nMy daughters like it a little spicier and they chose the Korean Cheesesteak which comes with gochujang sauce, american cheese, candied jalapeño, green onion & garlic aioli. Too spicy for me, but they all loved it... except for the candied jalapeños (which they got on the side). These girls are EXTREMELY picky and between the three gave it an average score of 4.5.\n\n\n| THE FRIES |\n\nI was born eating french fries. It has been my favorite food since I was old enough to remember eating. Fred's regular fries rank as some of my favorites fries anywhere, but dip them in the aioli and you truly have something special.\n\nMy daughters all wanted the garlic fries, which they LOVED. But even though I adore garlic on everything, it was a bit too much for me. I am totally satisfied staying in my regular fry lane!\n\n\n| FINAL THOUGHTS |\n\nWhile I truly enjoyed this experience, I'm going to remain moderate in my star upgrade from my previous review. However, if they pull of a cheesesteak masterpiece like this again in a future visit, I will upgrade them to a 5 for sure!\n\n\n\n2019 / 136th review [138th update]",
    "useful":411,
    "user_id":"JjXuiru1_ONzDkYVrHN0aw"
    },
    {
    "business_id":"fctjMmXEakMDVHcvJkL3sA",
    "cool":392,"date":"2019-08-12 11:37:11",
    "funny":288,"review_id":"RO1Gb9HFMIssNyo4I38ouA",
    "stars":5.0,
    "text":"I am a fan of creativity, exploration and nature! I'm often awed by the simplest of things, like how our body works to heal itself or slows down your metabolism when it senses your food intake is low.\n\nHow animals care for one another at a zoo such as a baby gorilla gripping its sister as she babysits, or a new born elephant as it runs and plays below the mighty legs of its mother, or a mother cheetah carefully cleaning her cubs; or simply that initial lift you feel as a plane takes off and the amazement of a movie such as Avatar where the visual stimulation for someone like me was almost too much to take in on the first viewing.\n\n...\n\n[ THE EXPERIENCE ]\n\nSo when I had the opportunity to return to Disney's Animal Kingdom, the one and only place I visited while inside the park was the World of Pandora. Needless to say Avatar Flight of Passage was top priority on my list. The line stated the wait was 210 minutes, but I truly don't think it took much more than an hour to make it all the way through.\n\nPart of that was because I met a woman from Texas coming back to ride for the second time with her uber-bright and sparky 10-year-old granddaughter. The two kept me enthralled in great conversation and time passed faster than I could have hoped.\n\nThis is a simulated ride, where you mount what feels like a motorcycle type seat that is meant to position you as if you were riding the back of a Banshee, like in the movie! Similar to the ride Soarin' in Epcot, you take flight with the help of a HUGE screen in front of you as the banshee moves through multiple movie inspired scenes. There is even the 4D effect of wind and water as you splash your way through waterfalls. However, one of the coolest and most unexpected 4D effects is how you can feel the banshee breathing as the area of the seat between your legs expands and contracts. IT WAS AMAZING!!!\n\nNot only did I truly feel like I was riding a banshee, my heart soared with excitement around every turn. This ride should be given by prescription to anyone suffering from depression, because there is no way you won't feel elated and encouraged by rides end.\n\nSHOUT OUT to the grandmother and granddaughter that I met in line! Truly enjoyed your company and regret we didn't exchange contact info. I hope the rest of your Orlando visit was as amazing as you!\n\n...\n\n[ FINAL THOUGHTS ]\n\nMy only sadness came from the fact that it was over so soon. If there were a separate version that lasted 30 minutes or more I would gladly pay whatever the extra cost would be to see more of this AMAZING World of Pandora via the back of my banshee, which I nicknamed Brown Sugah!!!\n\nIt is without a doubt my new favorite Orlando Disney Attraction followed by Soarin', Expedition Everest, Test Track, Tower of Terror, Indiana Jones Epic Stunt Spectacular, Big Thunder Mountain, Rock 'n' Roller Coaster & Kilimanjaro Safari.\n\nOh, and just in case you are wondering my favorites rides anywhere, they are 1) Goliath @ Six Flags Over Georgia 2) Maverick @ Cedar Point in Ohio & Cheetah Hunt @ Busch Gardens Tampa.\n\n\n2019/114",
    "useful":400,
    "user_id":"JjXuiru1_ONzDkYVrHN0aw"
    }
]
